In [1]:
pip install mysql.connector.python

Collecting mysql.connector.python
  Downloading mysql_connector_python-8.0.30-cp39-cp39-win_amd64.whl (7.8 MB)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\user\anaconda3\lib\site-packages (from mysql.connector.python) (3.19.1)
Installing collected packages: mysql.connector.python
Successfully installed mysql.connector.python-8.0.30
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector

In [4]:
from mysql.connector import Error
import pandas as pd

In [38]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(host=host_name,
                                             user=user_name,
                                             password=user_password
                                            )
        print("MySQL database connection succesful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

pw = 'Adidas@124'
db = "sql_python"

connection = connection = create_server_connection('localhost','root', pw)

MySQL database connection succesful

In [26]:
#Creating mysql_python

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print('Database successfully created')
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = 'Create database sql_python'
create_database(connection, create_database_query)

Database successfully created

In [28]:
#Connecting to database

def create_db_connection(host_name,user_name,user_password,db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name)
        print("MySQL database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [34]:
#Execute SQL queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was successfully executed')
    except Error as err:
        print(f"Error: '{err}'")

In [39]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(30) not null,
order_date date,
quantity_ordered int,
price float,
contact varchar(20));"""

connection = create_db_connection("localhost", 'root', pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Query was successfully executed

In [41]:
#Insert data

data_orders = """
insert into orders values
(001, 'Muwafaq Ayoade', 'Laptop', '2022-10-12', 2, 1000, '09070070001'),
(002, 'Abu Rumaysoh', 'Airpod', '2022-10-13', 3, 200, '09070070002'),
(003, 'Abu Hayan', 'Samsung s11', '2022-10-14', 4, 750, '09070070003'),
(004, 'Abu Umar', 'iPhone 14', '2022-10-15', 3, 900, '09070070004'),
(005, 'Abu Nabeelah', 'Huawei 55', '2022-10-16', 2, 750, '09070070005'),
(006, 'Abu Khadeejah', 'Smart watch', '2022-10-17', 2, 500, '09070070006'),
(007, 'Abu Husseinat', 'Smart book', '2022-10-16', 10, 200, '09070070007');
"""

connection = create_db_connection("localhost", 'root', pw, db)
execute_query(connection, data_orders)

MySQL database connection successful
Query was successfully executed

In [44]:
#Read queries and display result

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [46]:
#Using the select statment

q1 = """select * from orders;
"""

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successful
(1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001')
(2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002')
(3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003')
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')
(7, 'Abu Husseinat', 'Smart book', datetime.date(2022, 10, 16), 10, 200.0, '09070070007')

In [48]:

q2 = """select customer_name, contact from orders;
"""

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successful
('Muwafaq Ayoade', '09070070001')
('Abu Rumaysoh', '09070070002')
('Abu Hayan', '09070070003')
('Abu Umar', '09070070004')
('Abu Nabeelah', '09070070005')
('Abu Khadeejah', '09070070006')
('Abu Husseinat', '09070070007')

In [50]:
q3 = """select year(order_date)from orders;
"""

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successful
(2022,)
(2022,)
(2022,)
(2022,)
(2022,)
(2022,)
(2022,)

In [51]:
q4 = """select distinct year(order_date)from orders;
"""

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successful
(2022,)

In [53]:
q5 = """SELECT 
    *
FROM
    orders
WHERE
    order_date > '2022-10-14';
"""

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successful
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')
(7, 'Abu Husseinat', 'Smart book', datetime.date(2022, 10, 16), 10, 200.0, '09070070007')

In [58]:
#Raw display from MySQL Workbench

q6 = """ SELECT * FROM orders; """
connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successful
(1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001')
(2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002')
(3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003')
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')
(7, 'Abu Husseinat', 'Smart book', datetime.date(2022, 10, 16), 10, 200.0, '09070070007')

In [95]:

from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
    
print(from_db)

[[1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001'], [2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002'], [3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003'], [4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004'], [5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005'], [6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006']]

In [96]:
for result in results:
    print(result)

(1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001')
(2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002')
(3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003')
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')

In [73]:
#Creating a pandas dataframe from mysql database

from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", 'cutomer_name', 'product_name',
          'order_date', 'quantity', "price", 'contact']

df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,cutomer_name,product_name,order_date,quantity,price,contact
0,1,Muwafaq Ayoade,Laptop,2022-10-12,2,1000.0,09070070001
1,2,Abu Rumaysoh,Airpod,2022-10-13,3,200.0,09070070002
2,3,Abu Hayan,Samsung s11,2022-10-14,4,750.0,09070070003
3,4,Abu Umar,iPhone 14,2022-10-15,3,900.0,09070070004
4,5,Abu Nabeelah,Huawei 55,2022-10-16,2,750.0,09070070005
5,6,Abu Khadeejah,Smart watch,2022-10-17,2,500.0,09070070006

In [ ]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", 'cutomer_name', 'product_name',
          'order_date', 'quantity', "price", 'contact']

df = pd.DataFrame(from_db, columns = columns)
display(df)

In [57]:
df.head(10)

,order_id,cutomer_name,product_name,order_date,quantity,price,contact
0,4,Abu Umar,iPhone 14,2022-10-15,3,900.0,09070070004
1,5,Abu Nabeelah,Huawei 55,2022-10-16,2,750.0,09070070005
2,6,Abu Khadeejah,Smart watch,2022-10-17,2,500.0,09070070006
3,7,Abu Husseinat,Smart book,2022-10-16,10,200.0,09070070007

In [65]:
q7 = """ SELECT * FROM orders; """
connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL database connection successful
(1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001')
(2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002')
(3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003')
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')
(7, 'Abu Husseinat', 'Smart book', datetime.date(2022, 10, 16), 8, 200.0, '09070070007')

In [64]:
#Update command

update = """
Update orders set quantity_ordered = 8 where order_id = 7
"""

connection = create_db_connection("localhost", 'root', pw, db)
execute_query(connection, update)

MySQL database connection successful
Query was successfully executed

In [66]:
q8 = """ SELECT * FROM orders; """
connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successful
(1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001')
(2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002')
(3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003')
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')
(7, 'Abu Husseinat', 'Smart book', datetime.date(2022, 10, 16), 8, 200.0, '09070070007')

In [69]:
df.head(10)

,order_id,cutomer_name,product_name,order_date,quantity,price,contact
0,1,Muwafaq Ayoade,Laptop,2022-10-12,2,1000.0,09070070001
1,2,Abu Rumaysoh,Airpod,2022-10-13,3,200.0,09070070002
2,3,Abu Hayan,Samsung s11,2022-10-14,4,750.0,09070070003
3,4,Abu Umar,iPhone 14,2022-10-15,3,900.0,09070070004
4,5,Abu Nabeelah,Huawei 55,2022-10-16,2,750.0,09070070005
5,6,Abu Khadeejah,Smart watch,2022-10-17,2,500.0,09070070006
6,7,Abu Husseinat,Smart book,2022-10-16,8,200.0,09070070007

In [82]:
#Deleting a query

delete_orders = """delete from orders where order_id = 7"""

connection = create_db_connection("localhost", 'root', pw, db)
execute_query(connection, delete_orders)

MySQL database connection successful
Query was successfully executed

In [81]:
q9 = """ SELECT * FROM orders; """
connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successful
(1, 'Muwafaq Ayoade', 'Laptop', datetime.date(2022, 10, 12), 2, 1000.0, '09070070001')
(2, 'Abu Rumaysoh', 'Airpod', datetime.date(2022, 10, 13), 3, 200.0, '09070070002')
(3, 'Abu Hayan', 'Samsung s11', datetime.date(2022, 10, 14), 4, 750.0, '09070070003')
(4, 'Abu Umar', 'iPhone 14', datetime.date(2022, 10, 15), 3, 900.0, '09070070004')
(5, 'Abu Nabeelah', 'Huawei 55', datetime.date(2022, 10, 16), 2, 750.0, '09070070005')
(6, 'Abu Khadeejah', 'Smart watch', datetime.date(2022, 10, 17), 2, 500.0, '09070070006')

In [74]:
df.head(10)

,order_id,cutomer_name,product_name,order_date,quantity,price,contact
0,1,Muwafaq Ayoade,Laptop,2022-10-12,2,1000.0,09070070001
1,2,Abu Rumaysoh,Airpod,2022-10-13,3,200.0,09070070002
2,3,Abu Hayan,Samsung s11,2022-10-14,4,750.0,09070070003
3,4,Abu Umar,iPhone 14,2022-10-15,3,900.0,09070070004
4,5,Abu Nabeelah,Huawei 55,2022-10-16,2,750.0,09070070005
5,6,Abu Khadeejah,Smart watch,2022-10-17,2,500.0,09070070006

In [93]:
df.columns #to show the column names in a dataframe

df.index #to show index labels in dataframe

RangeIndex(start=0, stop=6, step=1)